Show / Hide Table of Contents
Namespace IdeaStatiCa.Plugin
Classes
ApplicationBIM
AutomationHosting<MyInterface, ClientInterface>
Responsible of hosting an automation service on net.pipe endpoint
AutomationHostingGrpc<MyInterface, ClientInterface>
Grpc Hosting implementation of AutomationHosting<MyInterface, ClientInterface>
AutomationService<ClientInterface>
BIMItemId
BIMItemsGroup
BIMPluginHosting
BIMPluginHostingGrpc
Grpc Implementation of BIMPluginHosting
BIMProject
ConnectionHiddenCheckClient
ConnHiddenClientFactory
Constants
ConversionDictionary<TKey>
ConversionDictionaryInt
ConversionDictionaryString
IdeaConnectionController
IdeaStatiCaAppClient
IdeaStatiCaClient<T>
ISEventArgs
LibraryItem
Identification of an item in IDEA StatiCa MPRL (material and product range library)
MemberHiddenClientFactory
MemberHiddenCheckClient
ModelBIM
NullLogger
Logger that does nothing.
ProgressSender
ProjectItem
Identification of an item in the Idea project
SerializableDictionary<TKey, TVal>
SerializableDictionary
Tools
Interfaces
IApplicationBIM
Abstraction of a FE application which provides data to Idea StatiCa
IAutomation
This interface is used for controlling Idea Statica application from external applictions.
IBIMPluginClient<T>
Responsible for controlling the connected BIM application to IS
IBIMPluginFactory
IBIMPluginHosting
IClientBIM<B>
IConnCalculatorFactory
IConnHiddenCheck
Provides seamlessly data about connections or allows to run hidden calculation of a connection
IIdeaStaticaApp
IMemberCalculatorFactory
IMemberHiddenCheck
Provides seamlessly data about connections or allows to run hidden calculation of a connection
IPluginLogger
Default logging interface.
IProgressCallback
Enums
AppStatus
AutomationStatus
BIMItemType
RequestedItemsType
Delegates
ISEventHandler